pyiin/stm32-usb/usb.c
#include <stdint.h>
#include "stm32f1xx.h"
#include "usb.h"
#include "misc.h"
#include "usb_scsi.h"
#include "key_matrix.h"

setup_packet_t setup = {0};
uint8_t address_pending = 0;
uint16_t address;

uint32_t buf[AUDIO_PCKTSIZ*2];

extern uint8_t hiddis;
extern uint8_t kbd_report[32];

uint8_t l = 0;

#define RX_FIFO_DEPTH_IN_WORDS 150
#define TX0_FIFO_DEPTH_IN_WORDS 50
#define TX1_FIFO_DEPTH_IN_WORDS 16
#define TX2_FIFO_DEPTH_IN_WORDS 16
#define TX3_FIFO_DEPTH_IN_WORDS 64

enum  {
	idle,
	stup,
	zlp_device,
	desc_in,
	data_in,
	data_out,
	zlp_host,
} ep0_state;
struct ep0_in_buf {
	uint32_t* buf;
	uint32_t size;
} ep0_in_state;

// mass_storage defines
uint32_t lun_number = 0;

// ======================= descriptors =======================
// every report needs to have uint32 size value in the beginning that is skipped when sending
#define HID_REPORT_SIZE1 78
uint8_t pre_hid_report1[] = {
	HID_REPORT_SIZE1, 0x00, 0x00, 0x00,
	0x05, 0x01, //usage page
	0x09, 0x06, //generic keyboard
	0xa1, 0x01, //collection
	0x05, 0x07, //usage page
	0x19, 0xe0, //usage min
	0x29, 0xe7,
	0x15, 0x00, //log min
	0x25, 0x01,
	0x95, 0x08,
	0x75, 0x01, //rep size
	0x81, 0x02,
	0x95, 0x01,
	0x75, 0x08,
	0x81, 0x01,
	0x05, 0x07,
	0x19, 0x00,
	0x29, 0xff,
	0x15, 0x00,
	0x26, 0xff, 0x00,
	0x95, 0x06,//0x06
	0x75, 0x08,
	0x81, 0x00,
	0x05, 0x08, //led page
	0x19, 0x01,
	0x29, 0x04,
	0x15, 0x00,
	0x25, 0x01,
	0x95, 0x04,
	0x75, 0x01,
	0x91, 0x02,
	0x05, 0x08, //led page
	0x19, 0x06,
	0x29, 0x09,
	0x15, 0x00,
	0x25, 0x01,
	0x95, 0x04,
	0x75, 0x01,
	0x91, 0x02,
	0xc0
};

#define HID_REPORT_SIZE2 45
#define HID_REPORT_SIZE HID_REPORT_SIZE2

uint8_t pre_hid_report2[] = {
	HID_REPORT_SIZE2, 0x00, 0x00, 0x00,
	0x5, 0x1, 0x9, 0x6, 0xa1, 0x1, /* 0x85, 0x6, */
	0x5, 0x7, 0x19, 0xe0, 0x29, 0xe7, 0x15, 0x0,
	0x25, 0x1, 0x95, 0x8, 0x75, 0x1, 0x81, 0x2,
	0x75, 0x08,
	0x95, 0x01,
	0x81, 0x01,
	0x5, 0x7,
	0x19, 0x04, 0x29, 0xa3, 0x15, 0x0,
	0x25, 0x1,  0x75, 0x1,0x95, 0xa0, 0x81, 0x2,
	0xc0,
};

uint32_t **hid_report = (uint32_t **)&(pre_hid_report2);

device_descriptor_t pre_usb_device_descriptor = {
	.send_size = 18,
    .bLength = 18,
    .bDescriptorType = USB_DESCRIPTOR_DEVICE,
    .bcdUSB = USB_BCD_2,
    .bDeviceClass = 0x00,
    .bDeviceSubClass = 0x00,
    .bDeviceProtocol = 0x00,
    .bMaxPacketSize0 = 64,
    .idVendor = 0xdeaf,//0x413c,//0x0483,
    .idProduct = 0xbeef,//0x2010,//0x5740,
    .bcdDevice = 0x0100,
    .iManufacturer = 1,
    .iProduct = 2,
    .iSerialNumber = 3,
    .bNumConfigurations = 1,
};
uint32_t** usb_device_descriptor = (uint32_t**)&(pre_usb_device_descriptor);

#define CONF_SIZE 9+9+9+9+9+9+7+11+7+12+7  +9+9+7 +9+7+7


full_configuration_descriptor_t pre_configuration_descriptor = {
    .send_size = CONF_SIZE,
    .usb_configuration_descriptor =
	{
		.bLength = 9,
		.bDescriptorType = USB_DESCRIPTOR_CONFIGURATION,
		.wTotalLength = CONF_SIZE,
		.bNumInterfaces = 4,
		.bConfigurationValue = 1,
		.iConfiguration = 0, // index of string descriptor
		.bmAttributes = 0b10000000,
		.bMaxPower = 50, // in 2mA units
	},
    .usb_interface_control_descriptor =
	{
		.bLength = 9,
		.bDescriptorType = 0x04,
		.bInterfaceNumber = 0,
		.bAlternateSetting = 0,
		.bNumEndpoints = 0,
		.bInterfaceClass = USB_AUDIO_CLASS,
		.bInterfaceSubClass = 0x01,
		.bInterfaceProtocol = 0x00,
		.iInterface = 0,
	},
    .audio_class =
	{
		.bLength = 9,
		.bDescriptorType = 0x24,
		.bDescriptorSubtype = 0x01,
		.bcdADC = 0x0100,
		.wTotalLength = 9 + 12 + 9,
		.bInCollection = 1,
		.baInterfaceNr = 1,
	},
    .input_terminal =
	{
		.bLength = 12,
		.bDescriptorType = 0x24,
		.bDescriptorSubtype = 0x02,
		.bTerminalID = 0x01,
		.wTerminalType = 0x0101,
		.bAssocTerminal = 0x00,
		.bNrChannels = 2,
		.wChannelConfig = 0x03,
		.iChannelNames = 0,
		.iTerminal = 0,
	},
    .output_terminal =
	{
		.bLength = 9,
		.bDescriptorType = 0x24,
		.bDescriptorSubtype = 0x03,
		.bTerminalID = 0x02,
		.wTerminalType = 0x0301,
		.bAssocTerminal = 0x00,
		.bSourceID = 0x01,
		.iTerminal = 0x00,
	},
    .usb_interface_streaming0_descriptor =
	{
		.bLength = 9,
		.bDescriptorType = 0x04,
		.bInterfaceNumber = 1,
		.bAlternateSetting = 0,
		.bNumEndpoints = 0,
		.bInterfaceClass = USB_AUDIO_CLASS,
		.bInterfaceSubClass = 0x02,
		.bInterfaceProtocol = 0x00,
		.iInterface = 0,
	},
    .usb_interface_streaming1_descriptor =
	{
		.bLength = 9,
		.bDescriptorType = 0x04,
		.bInterfaceNumber = 1,
		.bAlternateSetting = 1,
		.bNumEndpoints = 1,
		.bInterfaceClass = USB_AUDIO_CLASS,
		.bInterfaceSubClass = 0x02,
		.bInterfaceProtocol = 0x00,
		.iInterface = 0,
	},
    .audio_stream =
	{
		.bLength = 7,
		.bDescriptorType = 0x24,
		.bDescriptorSubtype = 0x01,
		.bTerminalLink = 0x02,
		.bDelay = 0,
		.wFormatTag = 0x01,
	},
    .format_type =
	{
		.bLength = 11,
		.bDescriptorType = 0x24,
		.bDescriptorSubtype = 0x02,
		.bFormatType = 0x01,
		.bNrChannels = 0x02,
		.bSubFrameSize = 0x04,
		.bBitResolution = 0x20,
		.bSamFreqType = 0x01,
		.bfreq0 = 0x80,
		.bfreq1 = 0xbb,
		.bfreq2 = 0x00,
	},
    .usb_endpoint1_descriptor =
	{
		.bLength = 7,
		.bDescriptorType = 0x05,
		.bEndpointAddress = 0x01,
		.bmAttributes = 0b00000001, // isynchronous?
		.wMaxPacketSize = AUDIO_PCKTSIZ,
		.bInterval = 1,
	},
    .endpoint_ACD = {
		.bLength = 7,
		.bDescriptorType = 0x25,
		.bDescriptorSubtype = 0x01,
		.bmAttributes = 0b00000000,
		.bLockDelayUnits = 0x00,
		.wLockDelay = 0,
    },
	.usb_interface_hid_descriptor = {
		.bLength = 9,
		.bDescriptorType = 0x04,
		.bInterfaceNumber = 2,
		.bAlternateSetting = 0,
		.bNumEndpoints = 1,
		.bInterfaceClass = USB_HID_CLASS,
		.bInterfaceSubClass = 0x00,
		.bInterfaceProtocol = 0x00,
		.iInterface = 0,
	},
    .usb_HID_descriptor = {
		.bLength = 9,
		.bDescriptorType = 0x21,
		.bcdHid = 0x0111,
		.bCountryCode = 0x00,
		.bNumDescriptors = 0x01,
		.bHidDescriptorType = 0x22,
		.wDescriptorLength = HID_REPORT_SIZE,
	},
	.usb_endpoint2_descriptor = {
		.bLength = 7,
		.bDescriptorType = 0x05,
		.bEndpointAddress = 0x82,
		.bmAttributes = 0b00000011,
		.wMaxPacketSize = HID_PCKTSIZ,
		.bInterval = 1,
	},
	.usb_interface_bbb_descriptor = {
            .bLength = 9,
            .bDescriptorType = 0x04,
            .bInterfaceNumber = 3,
            .bAlternateSetting = 0,
            .bNumEndpoints = 2,
            .bInterfaceClass = USB_MASS_STORAGE,
            .bInterfaceSubClass = 0x06,
            .bInterfaceProtocol = 0x50,
            .iInterface = 0,
	},
	.usb_endpoint2in_descriptor = {
		.bLength = 7,
		.bDescriptorType = 0x05,
		.bEndpointAddress = 0x83,
		.bmAttributes = 0x02,
		.wMaxPacketSize = 64,
		.bInterval = 0,
	},
	.usb_endpoint2out_descriptor = {
		.bLength = 7,
		.bDescriptorType = 0x05,
		.bEndpointAddress = 0x03,
		.bmAttributes = 0x02,
		.wMaxPacketSize = 64,
		.bInterval = 0,
	},
};
