pyiin/stm32-usb/usb.c
uint32_t** configuration_descriptor = (uint32_t**)&(pre_configuration_descriptor);

struct str_langid_s {
	uint32_t send_size;
	string_descriptor_t dsc;
	uint16_t langid;
} str_langid = {
	.send_size = 4,
	.dsc = {
		.bLength = 4,
		.bDescriptorType = USB_DESCRIPTOR_STRING,
	},
	.langid = 0x0409,
};

#define MANUF_LEN 5
struct str_manuf {
	uint32_t send_size;
	string_descriptor_t dsc;
	uint16_t str[MANUF_LEN];
} str_manuf = {
	.send_size = 2*MANUF_LEN+2,
    .dsc =
	{
		.bLength = 2*MANUF_LEN+2,
		.bDescriptorType = USB_DESCRIPTOR_STRING,
	},
    .str =
	{
		'S', 'T', 'M', '3', '2',
	},
};

#define PROD_LEN 15

struct str_prod {
	uint32_t send_size;
	string_descriptor_t dsc;
	uint16_t str[PROD_LEN];
} str_prod = {
	.send_size = 2*PROD_LEN+2,
    .dsc =
	{
		.bLength = 2*PROD_LEN+2,
		.bDescriptorType = USB_DESCRIPTOR_STRING,
	},
    .str =
	{
		'a', 'u', 'd', 'i', 'o', ' ', 'a', 'm', 'p', 'l', 'i', 'f', 'i', 'e', 'r',
	},
};

#define SN_LEN 12
struct str_sn {
	uint32_t send_size;
	string_descriptor_t dsc;
	uint16_t str[SN_LEN];
} str_sn = {
	.send_size = 2*SN_LEN+2,
    .dsc =
	{
		.bLength = 2*SN_LEN+2,
		.bDescriptorType = USB_DESCRIPTOR_STRING,
	},
    .str =
	{
		'0', '0', '0', '0', '0', '0',
		'0', '0', '0', '0', '0', '0'
	},
};

uint32_t *str_descs[] = {
	(uint32_t*)&str_langid,
	(uint32_t*)&str_manuf,
	(uint32_t*)&str_prod,
	(uint32_t*)&str_sn,
};

// ======================= helper fn =======================

void usbRawWrite(volatile uint32_t* fifo, void* data, uint32_t len) {
	uint32_t fifoWord;
	uint32_t *buffer = (uint32_t *)data;
	uint32_t remains = len;
	for (uint32_t idx = 0; idx < len; idx += 4, remains -= 4, buffer++) {
		switch (remains) {
		case 0:
			break;
		case 1:
			fifoWord = *buffer & 0xFF;
			*fifo = fifoWord;
			break;
		case 2:
			fifoWord = *buffer & 0xFFFF;
			*fifo = fifoWord;
			break;
		case 3:
			fifoWord = *buffer & 0xFFFFFF;
			*fifo = fifoWord;
			break;
		default:
			*fifo = *buffer;
			break;
		}
	}
}

inline USB_OTG_INEndpointTypeDef* usbEpin(uint8_t ep) {
    return (void*)(USB_OTG_FS_PERIPH_BASE + USB_OTG_IN_ENDPOINT_BASE + (ep << 5));
}

inline USB_OTG_OUTEndpointTypeDef* usbEpout(uint8_t ep) {
    return (void*)(USB_OTG_FS_PERIPH_BASE + USB_OTG_OUT_ENDPOINT_BASE + (ep << 5));
}

inline volatile uint32_t* usbEpFifo(uint8_t ep) {
    return (uint32_t*)(USB_OTG_FS_PERIPH_BASE + USB_OTG_FIFO_BASE + (ep << 12));
}


uint8_t ll = 0;
void usbZLP(uint8_t ep) {
	USB_OTG_INEndpointTypeDef* endpoint = usbEpin(ep);
	endpoint->DIEPTSIZ = (1 << USB_OTG_DIEPTSIZ_PKTCNT_Pos);
    endpoint->DIEPCTL |= USB_OTG_DIEPCTL_EPENA | USB_OTG_DIEPCTL_CNAK;
}

void usbWrite(uint8_t ep, void* data, uint32_t len) {
    USB_OTG_INEndpointTypeDef* endpoint = usbEpin(ep);
    volatile uint32_t* fifo = usbEpFifo(ep);

    uint32_t wordLen = (len + 3) >> 2;
	uint32_t rem = (endpoint->DTXFSTS & 0xffff);
    while (wordLen > (endpoint->DTXFSTS & 0xffff))
		;
	if ((ep != 0) && (endpoint->DIEPCTL & USB_OTG_DIEPCTL_EPENA)) {
        return;
    }
	uint32_t pcktcnt = ((len+63)>>6);
	endpoint->DIEPTSIZ = (pcktcnt << USB_OTG_DIEPTSIZ_PKTCNT_Pos) | len;
    endpoint->DIEPCTL |= USB_OTG_DIEPCTL_EPENA | USB_OTG_DIEPCTL_CNAK;
    usbRawWrite(fifo, data, len);
}
void usbWrite0(uint32_t *data, uint32_t len) {
	if (len <= 64) {
		usbWrite(0, data, len);
		ep0_state = data_in;
	} else {
		usbWrite(0, data, 64);
		ep0_in_state.buf = data + (64 / 4);
		ep0_in_state.size = len - 64;
		ep0_state = desc_in;
	}
}

uint32_t* usb_ep_buf[4];

void usb_ep_buf_set(uint8_t ep, uint32_t *buf) {
	if(ep < 4)
		usb_ep_buf[ep] = buf;
}

inline void usb_stall(uint8_t ep) { //TODO: add dir!
	USB_OTG_INEndpointTypeDef* epin = usbEpin(ep);
	USB_OTG_OUTEndpointTypeDef* epout = usbEpout(ep);
	epin->DIEPCTL |= USB_OTG_DIEPCTL_STALL;
	epout->DOEPCTL |= USB_OTG_DOEPCTL_STALL;
}

void ep_in_enable(uint8_t epn, uint8_t txnum, uint8_t eptype, uint16_t packet_size) {
	USB_OTG_INEndpointTypeDef* ep = usbEpin(epn);
	ep->DIEPCTL  = ((txnum & 0x03) << USB_OTG_DIEPCTL_TXFNUM_Pos);
	ep->DIEPCTL |= (eptype << USB_OTG_DIEPCTL_EPTYP_Pos);
	ep->DIEPCTL |= packet_size;
	ep->DIEPCTL |= USB_OTG_DIEPCTL_USBAEP;
	ep->DIEPCTL |= USB_OTG_DIEPCTL_SNAK;
	USB_OTG_FS_DEV->DAINTMSK |= (1<<epn);
}

void ep_out_enable(uint8_t epn, uint8_t eptype, uint16_t packet_size) {
	USB_OTG_OUTEndpointTypeDef* ep = usbEpout(epn);
	ep->DOEPCTL  = (eptype << USB_OTG_DOEPCTL_EPTYP_Pos);
	ep->DOEPCTL |= packet_size;
	ep->DOEPCTL |= USB_OTG_DOEPCTL_USBAEP;
	ep->DOEPCTL |= USB_OTG_DOEPCTL_SNAK;
	USB_OTG_FS_DEV->DAINTMSK |= (1<<(epn+16));
}

void set_ep0_idle() {
	USB_OTG_FS_DEV_ENDPOINT0_OUT->DOEPTSIZ =
		(3 << USB_OTG_DOEPTSIZ_STUPCNT_Pos) |
		(1 << USB_OTG_DOEPTSIZ_PKTCNT_Pos) |
		(8 << USB_OTG_DOEPTSIZ_XFRSIZ_Pos);

	USB_OTG_FS_DEV_ENDPOINT0_OUT->DOEPCTL = USB_OTG_DOEPCTL_EPENA |
		                                    USB_OTG_DOEPCTL_CNAK;
	ep0_state = idle;
}

void set_ep0_zlpdev() {
	USB_OTG_FS_DEV_ENDPOINT0_IN->DIEPTSIZ = (1 << USB_OTG_DIEPTSIZ_PKTCNT_Pos) |
		(0 << USB_OTG_DIEPTSIZ_XFRSIZ_Pos);
    USB_OTG_FS_DEV_ENDPOINT0_IN->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;

	ep0_state = zlp_device;
}

void set_ep0_zlphost() {
	USB_OTG_FS_DEV_ENDPOINT0_OUT->DOEPTSIZ =
		(1 << USB_OTG_DOEPTSIZ_PKTCNT_Pos);

	USB_OTG_FS_DEV_ENDPOINT0_OUT->DOEPCTL =
		USB_OTG_DOEPCTL_EPENA |
		USB_OTG_DOEPCTL_CNAK;

	ep0_state = zlp_host;
}

void usb_set_out_ep_iso(uint8_t epnum, uint32_t size, uint8_t pcktcnt, uint8_t parity) {
	USB_OTG_OUTEndpointTypeDef* ep = usbEpout(epnum);
	if(parity)
		ep->DOEPCTL |= USB_OTG_DOEPCTL_SODDFRM;
	else
		ep->DOEPCTL |= USB_OTG_DOEPCTL_SD0PID_SEVNFRM;
	usb_set_out_ep(epnum, size, pcktcnt);
}

void usb_set_out_ep(uint8_t epnum, uint32_t size, uint16_t pcktcnt) {
	USB_OTG_OUTEndpointTypeDef* ep = usbEpout(epnum);
	ep->DOEPTSIZ = (pcktcnt << USB_OTG_DOEPTSIZ_PKTCNT_Pos) |
		(size << USB_OTG_DOEPTSIZ_XFRSIZ_Pos);

	ep->DOEPCTL |=
		USB_OTG_DOEPCTL_EPENA |
		USB_OTG_DOEPCTL_CNAK;
}

//init functions

void clock_setup(){
	RCC->CR |= RCC_CR_HSEON; //enable hse
	while(!(RCC->CR & RCC_CR_HSERDY));

	/* RCC->BDCR |= RCC_BDCR_LSEON; //enable lse */
	/* while(!(RCC->CR & RCC_BDCR_LSEON)) light(0xab); */
	/* RCC->BDCR |= (1 <<RCC_BDCR_RTCSEL_Pos); */
	/* RCC->BDCR |= RCC_BDCR_RTCEN; */

	//setup prediv12 and prediv1scr
	RCC->CFGR2 |= RCC_CFGR2_PREDIV1_DIV2;
	RCC->CFGR |= (0b0111<<RCC_CFGR_PLLMULL_Pos);
	RCC->CFGR |= (0b0<<RCC_CFGR_OTGFSPRE_Pos);
	RCC->CFGR |= RCC_CFGR_PLLSRC;
	/* RCC->CFGR |= RCC_CFGR_HPRE_DIV2; */

	//enable pll
	RCC->CR |= RCC_CR_PLLON;
	while(!(RCC->CR & RCC_CR_PLLRDY));



