pyiin/stm32-usb/usb.c
	FLASH->ACR = FLASH_ACR_LATENCY_2 | FLASH_ACR_PRFTBE;
	//switch to pll
	RCC->CFGR |= RCC_CFGR_SW_PLL;

	// USB CLK
	RCC->AHBENR |= RCC_AHBENR_OTGFSEN;
	RCC->APB2ENR |= RCC_APB2ENR_IOPAEN | RCC_APB2ENR_AFIOEN;
}

void usb_core_init() {
	//make sure to set up vsense pin
    USB_OTG_FS->GCCFG |= USB_OTG_GCCFG_PWRDWN; // enable USB transceiver
    USB_OTG_FS->GAHBCFG |= USB_OTG_GAHBCFG_GINT;// | USB_OTG_GAHBCFG_PTXFELVL | USB_OTG_GAHBCFG_TXFELVL; //fifos completely empty

    USB_OTG_FS->GUSBCFG |= USB_OTG_GUSBCFG_TOCAL_0 | USB_OTG_GUSBCFG_TOCAL_1 | USB_OTG_GUSBCFG_TOCAL_2; // add clock cycles inter-packet timeout
    USB_OTG_FS->GUSBCFG |= (0x6 << USB_OTG_GUSBCFG_TRDT_Pos); //turnaround time
	USB_OTG_FS->GUSBCFG |= USB_OTG_GUSBCFG_FDMOD; //force device mode
	wait_clk(72000,25);

    USB_OTG_FS->GINTMSK |= USB_OTG_GINTMSK_USBRST |  USB_OTG_GINTMSK_OEPINT | USB_OTG_GINTMSK_IEPINT | USB_OTG_GINTMSK_SOFM;//USB_OTG_GINTMSK_MMISM | USB_OTG_GINTMSK_OTGINT | // un-mask global interrupt and mode mismatch interrupt

	USB_OTG_FS->GINTSTS = 0xffffffff; //zero all interrupts

	//set up interrupts
	NVIC_SetPriority(OTG_FS_IRQn, 1);
    NVIC_EnableIRQ(OTG_FS_IRQn);
}


/** Initialize the peripheral as device (not as host) */
void usb_device_init() {
    USB_OTG_FS_DEV->DCFG |= USB_OTG_DCFG_DSPD_0 | USB_OTG_DCFG_DSPD_1; // set device speed to full-speed
    USB_OTG_FS_DEV->DCFG |= USB_OTG_DCFG_NZLSOHSK; // send a STALL packet on non-zero-length status OUT transaction (default USB behavior)

    USB_OTG_FS->GINTMSK |=  USB_OTG_GINTMSK_ENUMDNEM | USB_OTG_GINTMSK_RXFLVLM;// | USB_OTG_GINTMSK_GINAKEFFM;
    USB_OTG_FS->GCCFG |= USB_OTG_GCCFG_VBUSBSEN; // enable V_BUS sensing "B"

	set_ep0_idle();

}


void usb_reset_handler() {
    USB_OTG_FS_DEV_ENDPOINT0_OUT->DOEPCTL |= USB_OTG_DOEPCTL_SNAK  ; // set the NAK bit for end-point 0

    // interrupt un-masking
	USB_OTG_FS_DEV->DAINTMSK |= 0x10001;
    USB_OTG_FS_DEV->DOEPMSK |= USB_OTG_DOEPMSK_XFRCM | USB_OTG_DOEPMSK_STUPM;
    USB_OTG_FS_DEV->DIEPMSK |= USB_OTG_DIEPMSK_XFRCM;// | USB_OTG_DIEPMSK_ITTXFEMSK;// | USB_OTG_DIEPINT_TXFE;// | (1<<3);

    USB_OTG_FS->GRXFSIZ = RX_FIFO_DEPTH_IN_WORDS;

    USB_OTG_FS->DIEPTXF0_HNPTXFSIZ = (TX0_FIFO_DEPTH_IN_WORDS << USB_OTG_TX0FD_Pos) | RX_FIFO_DEPTH_IN_WORDS;
	USB_OTG_FS->DIEPTXF[0] = ((TX1_FIFO_DEPTH_IN_WORDS) << USB_OTG_TX0FD_Pos)
		| (TX0_FIFO_DEPTH_IN_WORDS+RX_FIFO_DEPTH_IN_WORDS);
	USB_OTG_FS->DIEPTXF[1] = ((TX2_FIFO_DEPTH_IN_WORDS) << USB_OTG_TX0FD_Pos)
		| (TX0_FIFO_DEPTH_IN_WORDS+TX1_FIFO_DEPTH_IN_WORDS+RX_FIFO_DEPTH_IN_WORDS);
	USB_OTG_FS->DIEPTXF[2] = ((TX3_FIFO_DEPTH_IN_WORDS) << USB_OTG_TX0FD_Pos)
		| (TX0_FIFO_DEPTH_IN_WORDS+TX1_FIFO_DEPTH_IN_WORDS+TX2_FIFO_DEPTH_IN_WORDS+RX_FIFO_DEPTH_IN_WORDS);

	//flush fifos
	USB_OTG_FS->GRSTCTL = USB_OTG_GRSTCTL_RXFFLSH;
	while (USB_OTG_FS->GRSTCTL & USB_OTG_GRSTCTL_RXFFLSH);

	USB_OTG_FS->GRSTCTL = USB_OTG_GRSTCTL_TXFFLSH | (0b10000 << USB_OTG_GRSTCTL_TXFNUM_Pos);
	while (USB_OTG_FS->GRSTCTL & USB_OTG_GRSTCTL_TXFFLSH);

	USB_OTG_FS_DEV->DCTL |= USB_OTG_DCTL_CGONAK | USB_OTG_DCTL_CGINAK;

	set_ep0_idle();
}

void usb_enum_done_handler() {
    uint32_t enum_speed = (USB_OTG_FS_DEV->DSTS & 0x6) >> 1; // read the enumerated speed

    if (enum_speed == 3) {
		USB_OTG_FS_DEV_ENDPOINT0_IN->DIEPCTL =
			(USB_OTG_FS_DEV_ENDPOINT0_IN->DIEPCTL & ~USB_OTG_DIEPCTL_MPSIZ_Msk) |
			(64 << USB_OTG_DIEPCTL_MPSIZ_Pos);
    } // else soft reset
}

typedef struct descriptor_t {
	uint32_t** buf;
	uint8_t jmp;
	uint8_t maxidx;
} descriptor_t;

descriptor_t desc_array[] = {
    [USB_DESCRIPTOR_DEVICE] =        {.buf = (uint32_t **)&usb_device_descriptor, .jmp = 0, .maxidx = 0xff},
	[USB_DESCRIPTOR_CONFIGURATION] = {.buf = (uint32_t **)&configuration_descriptor, .jmp = 0, .maxidx = 0xff},
    [USB_DESCRIPTOR_HID_REPORT] =    {.buf = (uint32_t **)&hid_report, .jmp = 0, .maxidx = 0xff},
    [USB_DESCRIPTOR_STRING] =        {.buf = (uint32_t **)str_descs, .jmp = 1, .maxidx = 4},
    [USB_DESCRIPTOR_INTERFACE] =     {},
    [USB_DESCRIPTOR_ENDPOINT] =      {},
    [USB_DESCRIPTOR_QUALIFIER] =     {},
};

#define MIN(x,y) (x<y ? x : y)
void send_descriptor(uint8_t descidx, uint8_t descsub) {
	if (desc_array[descidx].buf == 0 || descsub >= desc_array[descidx].maxidx) {
		usb_stall(0);
		ep0_state = idle;
	} else {
		uint32_t **buf =
			desc_array[descidx].buf + descsub * desc_array[descidx].jmp;
		usbWrite0(*buf + 1, MIN(setup.wLength, **buf));

	}
}

void setup_device_to_host() {
	if (setup.bRequest == BREQUEST_GET_DESCRIPTOR) {
		send_descriptor((setup.wValue & 0xff00)>>8, setup.wValue & 0x00ff);
	} else if (setup.bRequest == BREQUEST_GET_STATUS) {
		uint16_t status = USB_STATUS_RESPONSE;
		usbWrite(0, &status, 2);
		ep0_state = data_in;
	}
}

void setup_host_to_device() {
    if (setup.bRequest == BREQUEST_SET_ADDRESS) {
		set_ep0_zlpdev();
		address = setup.wValue;
		address_pending = 1;
    }
	else if(setup.bRequest == BREQUEST_SET_CONFIGURATION) {
		set_ep0_zlpdev();
		ep_in_enable(HID_EPID, HID_EPID, EP_interrupt , HID_PCKTSIZ);
		hiddis = 0;
		usbWrite(HID_EPID, kbd_report, HID_PCKTSIZ);
		init_scsi();
    }
	else if(setup.bRequest == BREQUEST_SET_INTERFACE) {
		set_ep0_zlpdev();
		if(setup.wIndex == 1){
			if (setup.wValue == 1) {
				audio_init();
				ep_out_enable(1, EP_isyncronous, AUDIO_PCKTSIZ);
				usb_set_out_ep(1, AUDIO_PCKTSIZ, 1);
			}
			else {
				audio_deinit();
			}
		}
	}
}

uint16_t in_size = 0;
uint8_t ready_for_datain = 0;

void usb_handle_setup_packet() {
    uint32_t* buffer = (uint32_t*) &setup;
    for (uint16_t idx = 0; idx < 2; idx++, buffer++) {
        *buffer = *USB_OTG_FS_ENDPOINT0_FIFO;
    }

    if (setup.bmRequestType & 0x20) { // <----------------------- handle 0x21 control transfer
		if (setup.bRequest == 0x09) {
			ready_for_datain = 1;
		}
		if (setup.bRequest == BREQUEST_SET_IDLE) {
			usb_stall(0);
			/* set_ep0_idle(); */
		}
		if (setup.bRequest == 0xfe) { // get_max_LUN
			usbWrite(0, &lun_number, 1);
			USB_OTG_OUTEndpointTypeDef* epout = usbEpout(2);
			ep0_state = data_in;
			//			usb_set_out_ep(2, 32, 1);
		}
	}
	else if (setup.bmRequestType & 0x80)
        setup_device_to_host();
    else
        setup_host_to_device();
}

