pyiin/stm32-usb/usb.c
void usb_read_data() {
	volatile uint32_t* fifo;
	uint32_t* epbuf;
    uint32_t otg_status = USB_OTG_FS->GRXSTSP;
    uint32_t endpoint_number = otg_status & USB_OTG_GRXSTSP_EPNUM_Msk;
    uint32_t byte_count = (otg_status & USB_OTG_GRXSTSP_BCNT_Msk) >> USB_OTG_GRXSTSP_BCNT_Pos;
    /* uint32_t data_pid = (otg_status & USB_OTG_GRXSTSP_DPID_Msk) >> USB_OTG_GRXSTSP_DPID_Pos; */
    uint32_t packet_status = (otg_status & USB_OTG_GRXSTSP_PKTSTS_Msk) >> USB_OTG_GRXSTSP_PKTSTS_Pos;
    switch (packet_status) {
	case 0b0110:// PCKT_STS_SETUP:
		if (endpoint_number != 0 || byte_count != 8) {
			break;//while(1);
		}
		ep0_state = stup;
		usb_handle_setup_packet();
		break;
	case 0b0100:// PCKT_STS_SETUP_COMPLETE:
		if (ready_for_datain) {
            ready_for_datain = 0;
			in_size = setup.wLength;
            usb_set_out_ep(0, in_size, 1); // in_size
            ep0_state = data_out;
		}
		break;
	case 0b0010: // out packet recieved
		if(byte_count == 0) break;
		fifo = usbEpFifo(endpoint_number);

		epbuf = usb_ep_buf[endpoint_number];//make sure it is set
		for (uint16_t i = 0; i < ((byte_count + 3) >> 2); i++, epbuf++)
			*epbuf = *fifo;
		/* usb_ep_buf[endpoint_number] = epbuf; */
		if(endpoint_number == 3)
			scsi_packet_recieved(byte_count);
		if(endpoint_number == 1)
			stream_packet_recieved(byte_count);
		break;
	case 0b0011: //out transfer complete
		if (endpoint_number == 3)
			scsi_packet_in();
		if (endpoint_number == 0 && ep0_state == data_out)
			set_ep0_zlpdev();   // STATUS stage
		break;
	default:
		break;
    }
}


void usb_interrupt_out_handler() {
	uint32_t flags = USB_OTG_FS_DEV_ENDPOINT0_OUT->DOEPINT;
	if(USB_OTG_FS_DEV->DAINT & (0x01 << 16)){
		if (flags & USB_OTG_DOEPINT_STUP)
			USB_OTG_FS_DEV_ENDPOINT0_OUT->DOEPINT = USB_OTG_DOEPINT_STUP;
		if (flags & USB_OTG_DOEPINT_XFRC) {
			USB_OTG_FS_DEV_ENDPOINT0_OUT->DOEPINT = USB_OTG_DOEPINT_XFRC;
			if(ep0_state == zlp_host)
				set_ep0_idle();
		}
		if (address_pending) {
			USB_OTG_FS_DEV->DCFG &= ~USB_OTG_DCFG_DAD;
			USB_OTG_FS_DEV->DCFG |= (address << USB_OTG_DCFG_DAD_Pos);
			address_pending = 0;
			set_ep0_zlphost();
		}
	}
	if (USB_OTG_FS_DEV->DAINT & (0x02<<16)) {
		USB_OTG_OUTEndpointTypeDef* ep = usbEpout(1);
		if (ep->DOEPINT & USB_OTG_DOEPINT_XFRC)
			ep->DOEPINT = USB_OTG_DOEPINT_XFRC;
	}
	if (USB_OTG_FS_DEV->DAINT & (0x04<<16)) {
		USB_OTG_OUTEndpointTypeDef* ep = usbEpout(2);
		if (ep->DOEPINT & USB_OTG_DOEPINT_XFRC)
			ep->DOEPINT = USB_OTG_DOEPINT_XFRC;
	}
	if (USB_OTG_FS_DEV->DAINT & (0x08<<16)) {
		USB_OTG_OUTEndpointTypeDef* ep = usbEpout(3);
		if (ep->DOEPINT & USB_OTG_DOEPINT_XFRC)
			ep->DOEPINT = USB_OTG_DOEPINT_XFRC;
	}
}

void usb_interrupt_in_handler() {
	if(USB_OTG_FS_DEV->DAINT & 0x01){
          if (USB_OTG_FS_DEV_ENDPOINT0_IN->DIEPINT & USB_OTG_DIEPINT_XFRC) {
            /* transfer finished interrupt */
            USB_OTG_FS_DEV_ENDPOINT0_IN->DIEPINT = USB_OTG_DIEPINT_XFRC;
			if (ep0_state == desc_in)
				usbWrite0(ep0_in_state.buf, ep0_in_state.size);
            if (ep0_state == data_in)
				set_ep0_zlphost();

          }
	}
	if (USB_OTG_FS_DEV->DAINT & 0x02) {
		USB_OTG_INEndpointTypeDef* ep = usbEpin(1);
		if (ep->DIEPINT & USB_OTG_DIEPINT_XFRC)
			ep->DIEPINT = USB_OTG_DIEPINT_XFRC;
	}
	if (USB_OTG_FS_DEV->DAINT & 0x04) {
		USB_OTG_INEndpointTypeDef* ep = usbEpin(2);
		if (ep->DIEPINT & USB_OTG_DIEPINT_XFRC)
			ep->DIEPINT = USB_OTG_DIEPINT_XFRC;
		read_keys();
		get_report();
		usbWrite(HID_EPID, kbd_report, HID_PCKTSIZ);

	}
	if (USB_OTG_FS_DEV->DAINT & 0x08) {
		USB_OTG_INEndpointTypeDef *ep = usbEpin(3);
		if (ep->DIEPINT & USB_OTG_DIEPINT_XFRC)
            ep->DIEPINT = USB_OTG_DIEPINT_XFRC;
		scsi_packet_sent();
	}
}


void OTG_FS_IRQHandler() {
	if (USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_USBRST) {
		USB_OTG_FS->GINTSTS = USB_OTG_GINTSTS_USBRST;
        usb_reset_handler();
    }
    if (USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_ENUMDNE) {
        USB_OTG_FS->GINTSTS = USB_OTG_GINTSTS_ENUMDNE;
        usb_enum_done_handler();
    }
    if (USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_RXFLVL) {
		USB_OTG_FS->GINTMSK &= ~USB_OTG_GINTMSK_RXFLVLM;
		usb_read_data();
		USB_OTG_FS->GINTMSK |= USB_OTG_GINTMSK_RXFLVLM;
    }
    if (USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_OEPINT) {
        usb_interrupt_out_handler();
    }
    if (USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_IEPINT) {
        usb_interrupt_in_handler();
    }
	if (USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_SOF) {
		USB_OTG_FS->GINTSTS = USB_OTG_GINTSTS_SOF;
		audio_check_sync();
    }
}
